{
  "projectsInfo": [
    {
      "id": "pokedex",
      "name": "pokedex",
      "type": ["front-end"],
      "description": "O projeto criou uma Pokédex responsiva em React usando dados da API pokeapi.co. A aplicação foi dividida em duas páginas: Home e Detalhes do Pokémon. A Home exibiu uma lista de Pokémons com nome, imagem, ID e tipos, com opção de adicionar mais Pokémons à lista e filtrá-la por tipos selecionados pelo usuário. Ao clicar em um Pokémon da lista, o usuário era redirecionado para a página Detalhes, que exibia informações mais detalhadas como habilidades e movimentos do Pokémon selecionado. O gerenciamento das rotas da aplicação foi feito com BrowserRouter, permitindo navegação amigável do usuário entre as páginas. Foram criados testes unitários usando Jest e React Testing Library para verificar a funcionalidade da aplicação, garantindo maior confiabilidade na aplicação como um todo.",
      "descriptionShort": "Pokédex responsiva em React utilizando a API pokeapi.co. Tendo uma página Home com a opção de adicionar mais Pokémons e uma página especifica para cada Pokémon.",
      "images": ["pokedex-1.png", "pokedex-2.png", "pokedex-3.png"],
      "techs": [
        "html",
        "css",
        "js",
        "react",
        "git",
        "jest",
        "jquery",
        "nodejs",
        "npm",
        "figma"
      ],
      "techsShort": ["react", "js", "css", "jquery"],
      "deploy": "https://victoraamlima.github.io/pokedex/",
      "repository": "https://github.com/victoraamlima/pokedex"
    },
    {
      "id": "github-profile",
      "name": "perfil github",
      "type": ["front-end"],
      "description": "Este projeto usa a API do GitHub, que é um serviço que guarda e compartilha dados de programação, para ver dados de um usuário do GitHub. Ele usa o JavaScript, que é uma linguagem de programação, para pedir os dados ao GitHub usando um código específico chamado endpoint. Ele usa o HTML e CSS, que são linguagens de marcação, para mostrar os dados na Web de forma organizada e bonita. Os dados que ele mostra são: o nome, a foto e o texto do perfil do usuário, que são informações pessoais; o nome, as cópias, as curtidas, as visualizações e a linguagem dos projetos do usuário, que são informações sobre o que ele programou; e o projeto e a ação das atividades do usuário, que são informações sobre o que ele fez recentemente no GitHub.",
      "descriptionShort": "Projeto responsivo utilizando a API do GitHub para acessar as informações do perfil e seus repositórios, ele foi criado com HTML, CSS e Javascript.",
      "images": ["github-profile.png"],
      "techs": ["js", "css", "html", "git"],
      "techsShort": ["js", "css", "html"],
      "deploy": "https://victoraamlima.github.io/perfil-gitHub/",
      "repository": "https://github.com/victoraamlima/perfil-gitHub"
    },
    {
      "id": "meu-time",
      "name": "meu time",
      "type": ["front-end"],
      "description": "Este projeto é um site responsivo que permite obter informações sobre times de futebol de diferentes países, ligas e temporadas. Ele consiste em duas páginas: uma de login, onde o usuário pode se autenticar, e outra de home, onde o usuário pode selecionar o time de sua preferência. Na home, o usuário pode visualizar informações como o brasão do time, a formação mais usada, o desempenho nos jogos, o número de gols por intervalo de tempo e os dados dos jogadores. O projeto foi desenvolvido em React.js, utilizando a API API-FOOTBALL para obter os dados. Ele também usou o BrowserRouter do React Router para o gerenciamento das páginas, o Context API para os contextos e o Styled-components para as estilizações.",
      "descriptionShort": "Eu fiz uma aplicação web em React que mostra informações sobre times de futebol. A aplicação usa uma API externa para obter os dados e tem um layout responsivo.",
      "images": ["meu-time.png"],
      "techs": ["react", "js", "css", "html", "git", "nodejs", "npm", "figma"],
      "techsShort": ["react", "js", "css", "html"],
      "deploy": "https://victoraamlima.github.io/meu-time/",
      "repository": "https://github.com/victoraamlima/meu-time"
    },
    {
      "id": "evaluation",
      "name": "avaliação",
      "type": ["front-end"],
      "description": "Este é um projeto de programação web que simula um questionário de avaliação de um site. Ele usa as linguagens HTML, CSS e Javascript para criar uma interface interativa onde o usuário pode dar uma nota de 1 a 5 para o site. Depois de dar a nota, o usuário é redirecionado para uma tela de agradecimento que mostra a sua nota e uma mensagem.",
      "descriptionShort": "Projeto feito com HTML, CSS, Javascript, simulando um questionário de avaliação de um site.",
      "images": ["evaluation.png"],
      "techs": ["js", "css", "html", "git"],
      "techsShort": ["js", "css", "html"],
      "deploy": "https://victoraamlima.github.io/avaliacao/",
      "repository": "https://github.com/victoraamlima/avaliacao"
    }
  ]
}
